
import "./style.css"

export const AnimalAdoptReminder = (props: { onClose: Function }) => {
    return <>
        <h2 className="reminder-header">Памятка по уходу за домашними питомцами</h2>

        <ol className="reminder-main-list">
            <li>
                Питание
                <ul>
                    <li>Кормите питомца качественным кормом, подходящим по возрасту и породе.</li>
                    <li>Следите за размером порций, избегайте перекармливания.</li>
                    <li>Всегда обеспечивайте доступ к свежей воде.</li>
                </ul>
            </li>
            <li>
                Гигиена
                <ul>
                    <li>Регулярно чистите шерсть, уши и зубы (по необходимости).</li>
                    <li>Купайте питомца с использованием специальных средств (не слишком часто).</li>
                    <li>Своевременно убирайте лоток или место для туалета.</li>
                </ul>
            </li>
            <li>Здоровье</li>

            <ul>
                <li>Регулярно посещайте ветеринара для профилактических осмотров.</li>
                <li>Своевременно делайте прививки и обработку от паразитов (блох, глистов).</li>
                <li>Следите за активностью и аппетитом – любые изменения могут быть признаком болезни.</li>
            </ul>

            <li>Активность и внимание</li>

            <ul>
                <li>Ежедневно играйте и выгуливайте питомца (для собак – минимум 2 раза в день).</li>
                <li>Обеспечьте игрушками и когтеточками (для кошек).</li>
                <li>Уделяйте внимание, питомцы нуждаются в ласке и общении.</li>
            </ul>

            <li>Безопасность</li>

            <ul>
                <li>Уберите опасные предметы и токсичные вещества из зоны доступа.</li>
                <li>Не оставляйте питомца одного в закрытом автомобиле или на жаре/холоде.</li>
                <li>Используйте переноску или шлейку при перевозке.</li>
            </ul>
        </ol>

        <h3 className="reminder-sub-header">Любите своего питомца, и он ответит вам преданностью и хорошим настроением!</h3>

        <button className="exit-button" onClick={() => props.onClose()}>Назад</button>
    </>
}

